Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: While a localized interface enables easy refactoring an external file might be more convenient in many situations.
ja_jp: ローカライズされたインターフェイスはリファクタリングを容易にしますが、多くの場合、外部ファイルの方が便利かもしれません。

source: While a localized interface enables easy refactoring, an external file might be more convenient in many situations.
ja_jp: ローカライズされたインターフェイスはリファクタリングを容易にしますが、外部ファイルの方が便利な場面も多いかもしれません。

source: While a normal message emitter would support concurrent calls to `send` methods and consequently queues outgoing messages to be written to Kafka, a `KafkaTransactions` emitter only supports one transaction at a time. A transaction is considered in progress from the call to the `withTransaction` until the returned `Uni` results in success or failure. While a transaction is in progress, subsequent calls to the `withTransaction`, including nested ones inside the given function, will throw `IllegalStateException`.
ja_jp: 通常のメッセージエミッターは `send` メソッドへの同時呼び出しをサポートし、結果として Kafka に書き込まれる送信メッセージをキューに入れますが、 `KafkaTransactions` エミッターは一度に 1 つのトランザクションのみをサポートします。トランザクションは、 `withTransaction` の呼び出しから、返された `Uni` が成功または失敗するまで進行中であると見なされます。トランザクションの進行中に、指定された関数内のネストされたものを含む `withTransaction` への後続の呼び出しは、 `IllegalStateException` をスローします。

source: While adding test-specific configuration properties using `src/test/resources/application.properties` (note there's `test`, not `main`) is possible for unit tests, it's not possible for integration tests.
ja_jp: `src/test/resources/application.properties` を使用してテスト固有の設定プロパティーを追加する際 (`main` ではなく `test` があることに注意)、 ユニットテストは可能ですが、インテグレーションテストは不可能です。

source: While all constraints with corresponding Jakarta Validation rules will apply during the `callback` validation, in the `ddl` mode, only a subset of constraints is used to influence the DDL. In the Hibernate Validator documentation, you can find link:{hibernate-validator-docs-url}#section-builtin-constraints[the list of available constraints] and their impact on the DDL generation.
ja_jp: 対応する Jakarta Validation ルールを持つすべての制約は `callback` バリデーション中に適用されますが、 `ddl` モードでは、DDL に影響を与えるために制約のサブセットのみが使用されます。Hibernate Validator のドキュメントに、 link:{hibernate-validator-docs-url}#section-builtin-constraints[利用可能な制約のリスト] とそれらが DDL 生成に与える影響が記載されています。

source: While both are used to generate resources, their purposes and behaviors differ:
ja_jp: どちらもリソースを生成するために使用されますが、目的と動作は異なります。

source: While configuration of the validator factory is not possible through XML, constraint declaration is. Quarkus accepts constraints defined by annotations in your classes or in the `validation.xml`.
ja_jp: バリデーターファクトリーの設定はXML経由ではできませんが、制約の宣言は可能です。Quarkus は、クラス内のアノテーションまたは `validation.xml` で定義された制約を受け入れます。

source: While developers can download distributions directly from the https://adoptium.net/[Adoptium website^] with a single click, it becomes more of a challenge to automate this process, for example in a CI/CD pipeline. This is especially true due to the number of variants of Java versions, release types, operating systems, architectures, JVM implementations, etc. To that end, Adoptium needed to offer a way to programmatically discover and access pre-built binaries based on these variables, and produced https://api.adoptium.net/q/swagger-ui/[an end-user API^].
ja_jp: 開発者は link:https://adoptium.net/[Adoptium のウェブサイト^]からワンクリックで直接ディストリビューションをダウンロードできますが、例えば CI/CD パイプラインでこのプロセスを自動化することはより困難になります。これは、Javaのバージョン、リリースタイプ、オペレーティングシステム、アーキテクチャ、JVMの実装などのバリエーションが多いために特に顕著です。そのため、Adoptiumは、これらの変数に基づいてプログラムで事前に構築されたバイナリを発見してアクセスする方法を提供する必要があり、 link:https://api.adoptium.net/q/swagger-ui/[エンドユーザAPI^]を作成しました。

source: While everyone else focuses on how to change the world, we will focus on how to change ourselves from within first.
ja_jp: みんなが世界を変える方法に注目している中、私たちはまず自分自身を内側から変える方法に注目します。

source: While everything is not yet set up for our REST service, we can initialize it with the standard CRUD operations we will need.
ja_jp: まだRESTサービスの設定はすべて終わっていませんが、必要となる標準的なCRUD操作で初期化することができます。

source: While extensions automatically use the TLS registry, you can also access the TLS configuration programmatically through the registry API.
ja_jp: エクステンションは自動的に TLS レジストリーを使用します。一方、ユーザーはレジストリー API を介してプログラムで TLS 設定にアクセスすることもできます。

source: While having encrypted values, is better than plain values, we would still like to avoid having these set up in `application.properties`.
ja_jp: 暗号化された値を持つことは、平文の値よりも良いことですが、 `application.properties` で設定することは避けたいと思います。

source: While idiomatic way of creating `PulsarClient`, `PulsarConsumer` or `PulsarProducer` are through builder APIs, in its essence those APIs build each time a configuration object, to pass onto the implementation. Those are https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ClientConfigurationData.html[ClientConfigurationData], https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ConsumerConfigurationData.html[ConsumerConfigurationData] and https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ProducerConfigurationData.html[ProducerConfigurationData].
ja_jp: 通常、 `PulsarClient`、 `PulsarConsumer`、 `PulsarProducer` を作成するには、ビルダー API を使用します。ビルダー API は、その性質上、実装に渡す設定オブジェクトを毎回ビルドします。 該当する設定オブジェクトは、 https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ClientConfigurationData.html[ClientConfigurationData]、 https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ConsumerConfigurationData.html[ConsumerConfigurationData]、 および https://javadoc.io/doc/org.apache.pulsar/pulsar-client-original/latest/org/apache/pulsar/client/impl/conf/ProducerConfigurationData.html[ProducerConfigurationData] です。

source: While interacting with containers is mostly identical between Mac, Windows, and Linux, there are important environmental differences to be aware of. Notably, the way in which containers are executed is different, since "Containers are Linux". More specifically, containers contain Linux userland binaries with a dependency on the Linux kernel syscall interface. As such, Linux containers cannot run natively on macOS or Windows; they instead require the use of a virtual machine (VM), running Linux, to host them. For systems that require it, Podman includes a subsystem called Podman Machine that is used to manage this VM. Podman Desktop performs a guided interactive setup of this VM, and will automatically launch it on your behalf.
ja_jp: コンテナとのやり取りはMac、Windows、Linuxの間でほとんど同じですが、注意すべき重要な環境の違いがあります。特に、「コンテナはLinux」であるため、コンテナの実行方法が異なります。具体的には、コンテナはLinuxカーネル・システムコール・インターフェースに依存するLinuxユーザーランド・バイナリです。そのため、LinuxコンテナはmacOSやWindows上でネイティブに実行できません。代わりに、Linuxを実行する仮想マシン（VM）を使用してコンテナをホストする必要があります。それが必要なシステムのために、PodmanにはこのVMを管理するためのPodman Machineというサブシステムが含まれています。Podman Desktopは、このVMのガイド付き対話型セットアップを行い、あなたの代わりに自動的に起動します。

source: While it can be seen as a limitation, it opens all sorts of possibilities, one of which is the ability to index the classes and their annotations to easily look them up.
ja_jp: これは制限とも言えますが、様々な可能性を秘めています。その1つが、クラスとそのアノテーションにインデックスを付けて、簡単に調べられるようにすることです。

source: While it is handy to have the documentation available when coding, the configuration documentation must also be available in the extension guides. The Quarkus build automatically generates the configuration documentation based on the Javadoc comments, but it needs to be explicitly included in each guide.
ja_jp: コーディング時にドキュメントを利用できるのは便利ですが、設定ドキュメントもエクステンションガイドで利用できるようにする必要があります。Quarkusのビルドでは、Javadocのコメントに基づいて設定ドキュメントが自動的に生成されますが、各ガイドに明示的に記載する必要があります。

source: While it is handy to have the documentation available when coding, this configuration documentation must also be available in the extension guides. The Quarkus build automatically generates the configuration documentation for you based on the Javadoc comments but you need to explicitly include it in your guide.
ja_jp: コーディング時にドキュメントを利用できるようにしておくと便利ですが、この設定ドキュメントはエクステンションガイドでも利用できるようにしておく必要があります。Quarkusのビルドでは、Javadocのコメントに基づいて設定ドキュメントが自動的に生成されますが、ガイドに明示的に含める必要があります。

source: While it is handy to have the documentation available when coding, this configuration documentation must also be available in the extension guides. The Quarkus build automatically generates the configuration documentation for you based on the Javadoc comments, but you need to explicitly include it in your guide.
ja_jp: コーディング時にドキュメントを利用できるようにしておくと便利ですが、この設定ドキュメントはエクステンションガイドでも利用できるようにしておく必要があります。Quarkusのビルドでは、Javadocのコメントに基づいて設定ドキュメントが自動的に生成されますが、ガイドに明示的に含める必要があります。

source: While it is possible to use JUnit Jupiter callback interfaces like `BeforeEachCallback`, you might run into classloading issues because Quarkus has to run tests in a custom classloader which JUnit is not aware of.
ja_jp: `BeforeEachCallback` のような JUnit Jupiter コールバックインターフェースを使用することは可能ですが、Quarkus では JUnit が認識していないカスタムクラスローダーでテストを実行する必要があるため、クラスロードの問題が発生する可能性があります。

source: While it's not the default, we recommend using the Vert.x based client, as it is more flexible and better integrated in the Quarkus ecosystem. It does not change the stubs you can use, as they are generated by the gRPC framework. However, it changes the way the client communicates with the server.
ja_jp: デフォルトではありませんが、より柔軟性が高く、Quarkus エコシステムとの統合性が高い、Vert.x ベースのクライアントを使用することが推奨されます。 stub は gRPC フレームワークによって生成されるため、使用できる stub は変更されません。 ただし、クライアントがサーバーと通信する方法は変わります。

source: While it's the CRaC API, SnapStart is not CRaC and can do _things_ that would not work with others CRaC implementations.
ja_jp: CRaC APIではありますが、SnapStartはCRaCではないので、他のCRaC実装では動作しないような _こと_ を行うことができます。

source: While iterating on development, we felt the need to implement an integration test based on a real world use case.
ja_jp: 開発を繰り返す中で、実際のユースケースに基づいた統合テストを実装する必要性を感じました。

source: While it’s technically possible to use Hibernate Search and Elasticsearch in distributed applications, by default they suffer from link:{hibernate-search-doc-prefix}#architecture-examples-no-coordination-elasticsearch-pros-and-cons[a few limitations].
ja_jp: Hibernate SearchやElasticsearchを分散型アプリケーションで使用することは技術的には可能ですが、デフォルトでは link:{hibernate-search-doc-prefix}#architecture-examples-no-coordination-elasticsearch-pros-and-cons[いくつかの制限]があります。

source: While it’s technically possible to use Hibernate Search and Elasticsearch in distributed applications, by default they suffer from link:{hibernate-search-docs-url}#architecture-examples-no-coordination-elasticsearch-pros-and-cons[a few limitations].
ja_jp: Hibernate Search や Elasticsearch を分散型アプリケーションで使用することは技術的には可能ですが、デフォルトでは link:{hibernate-search-docs-url}#architecture-examples-no-coordination-elasticsearch-pros-and-cons[いくつかの制限] があります。

source: While keystores and truststores are the most important properties, there are other properties you can use to configure TLS.
ja_jp: キーストアとトラストストアは最も重要なプロパティーですが、TLS を設定するために使用できる他のプロパティーもあります。

source: While link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] builds a complex `Cache-Control` header, link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] is a simplified notation to say that you don't want anything cached; i.e. `Cache-Control: nocache`.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] は複雑な`Cache-Control` ヘッダーを構築しますが、link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] は、キャッシュしない (`Cache-Control: nocache`) ことを指示する簡素化された表記です。

source: While named "reactive", RESTEasy Reactive supports equally well both traditional blocking patterns and reactive patterns.
ja_jp: RESTEasy Reactiveは、「リアクティブ」という名前が付いていますが、従来のブロッキングパターンとリアクティブパターンの両方を同じようにサポートしています。

source: While not recommended, you can trust all certificates by setting `quarkus.tls.trust-all` to `true`:
ja_jp: 推奨はされませんが、 `quarkus.tls.trust-all` を `true` に設定することで、すべての証明書を信頼することができます。

source: While running in Quarkus Dev Mode, you can feed events to it by doing an HTTP POST to `http://localhost:8080`. The mock event server will receive the events and your lambda will be invoked. You can perform live coding on your lambda and changes will automatically be recompiled and available the next invocation you make. Here's an example:
ja_jp: Quarkus Dev モードで実行しているときに、 `http://localhost:8080` に HTTP POST を実行することで、イベントをフィードできます。模擬イベントサーバーがイベントを受信し、ラムダが呼び出されます。Lambda でライブコーディングを実行すると、変更が自動的に再コンパイルされ、次に行う呼び出しで利用できるようになります。次に例を示します。

source: While standard Hibernate ORM entities can belong to several persistence units, Panache entities can only belong to one persistence unit.
ja_jp: 標準のHibernate ORMエンティティは複数の永続化ユニットに所属できますが、Panacheエンティティは1つの永続化ユニットにしか所属できません。

source: While standard Javadoc comments are perfectly fine for simple documentation (recommended even), AsciiDoc is more suitable for tips, source code extracts, lists and more:
ja_jp: 標準的なJavadocのコメントは単純なドキュメントには全く問題ありませんが（むしろ推奨）、AsciiDocはヒント、ソースコードの抽出、リストなどに適しています：

source: While test resources provided by `@QuarkusTestResource` are available either globally or restricted to the annotated test class (`restrictToAnnotatedClass`), the annotation `@WithTestResource` allows to additionally group tests by test resources for execution. `@WithTestResource` has a `scope` property that takes a `TestResourceScope` enum value:
ja_jp: `@QuarkusTestResource` によって提供されるテストリソースは、グローバルに使用できるか、またはアノテーション付きテストクラス (`restrictToAnnotatedClass`) に制限されますが、アノテーション `@WithTestResource` を使用すると、実行用にテストリソース別にテストをさらにグループ化できます。 `@WithTestResource` には、 `TestResourceScope` 列挙値を取る `scope` プロパティーがあります。

source: While the REST Client Reactive extension aims to be a drop-in replacement for the REST Client extension, there are some differences and limitations:
ja_jp: REST Client Reactive エクステンションは、REST Client エクステンションをそのまま置き換えることを目的としていますが、いくつかの相違点と制限があります。

source: While the REST Client extension aims to be a drop-in replacement for the RESTEasy Client extension, there are some differences and limitations:
ja_jp: REST Client エクステンションは、REST Client エクステンションのドロップインリプレースメントを目的としていますが、いくつかの違い や制限があります。

source: While the `BUILD` RunStage is expected to run at build time - as the name already suggests - there are additional RunStages that also execute at build time.
ja_jp: `BUILD` RunStage はその名の通りビルド時に実行されることが期待されますが、ビルド時に実行される追加の RunStage も存在します。

source: While the `Log` API simplifies logging in application classes, it is not recommended for use in extension modules or external dependencies.
ja_jp: `Log` API はアプリケーションクラスでのログ記録を簡素化しますが、拡張モジュールや外部依存関係での使用は推奨されません。

source: While the `ValidatorFactory` is instantiated by Quarkus itself, you can very easily tweak it by declaring replacement beans that will be injected in the configuration.
ja_jp: `ValidatorFactory` は、Quarkus 自体によってインスタンス化されていますが、設定に注入される代わりのBeanを宣言することで、非常に簡単に微調整することができます。

source: While the default mapping is simple, it might not always be feasible. You can change this default mapping through configuration. Let's look at the next function:
ja_jp: デフォルトのマッピングはシンプルですが、必ずしもうまくいくとは限りません。このデフォルトのマッピングは設定で変更することができます。次の関数を見てみましょう。

source: While the first release of the application is slated for 2022, the application will continue far beyond that. Team Polaris is already looking for ways to improve performance, reliability, security, and scalability. This includes things like implementing a reactive architecture for microservices.
ja_jp: アプリケーションの最初のリリースは2022年を予定していますが、アプリケーションはそれよりもずっと先まで続きます。チームポラリスはすでに、パフォーマンス、信頼性、セキュリティ、スケーラビリティを向上させる方法を模索しています。これには、マイクロサービスのリアクティブアーキテクチャの実装などが含まれます。

source: While the following examples use the _default_ configuration, you can use the _named_ configuration by prefixing the properties with the configuration's name.
ja_jp: 次の例では _デフォルト_ の設定を使用していますが、プロパティーの前に設定名を付けることで、_名前付き_ 設定を使用することもできます。

source: While the improvements aren't quite as substantial as with native executables, and the container image size is a bit larger due to the AOT cache file, the results are impressive given the minimal effort required:
ja_jp: 改善はネイティブ実行可能ファイルほど実質的ではなく、AOT キャッシュファイルのためにコンテナーイメージサイズが若干大きくなりますが、必要とされる労力が最小限であることを考えると、その結果は印象的です。

source: While the resulting model looked efficient and straightforward for us, non-aware users have seen a lot of:
ja_jp: 結果として得られたモデルは、我々にとっては効率的でわかりやすいものに見えましたが、意識していないユーザーは多くのものを目にしています:

source: While the set of configuration attributes used to configure paths in Quarkus remains unchanged, how configured values are interpreted is different:
ja_jp: Quarkusでパスを設定するために使用される設定属性のセットは変更されませんが、設定された値がどのように解釈されるかは異なります。

source: While there are a lot of great features the move to Hibernate 6.2 introduces some breaking changes. We created a <a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration">Hibernate ORM migration guide</a> to make the upgrade from 5 to 6 as smooth as possible.
ja_jp: 素晴らしい機能がたくさんある一方で、Hibernate 6.2への移行は、いくつかの破壊的な変更をもたらします。私たちは、5から6へのアップグレードをできるだけスムーズに行うために、<a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration">Hibernate ORM移行ガイド</a>を作成しました。

source: While this approach has the benefit of independent container scaling as well as an independent lifecycle it may sometimes be over engineered for small applications.
ja_jp: このアプローチには、独立したコンテナのスケーリングと独立したライフサイクルという利点がありますが、小規模なアプリケーションには過剰なエンジニアリングとなる場合があります。

source: While this document is a useful reference, the client help is the definitive source.
ja_jp: このドキュメントは便利なリファレンスですが、最も信頼のおける情報源はクライアントヘルプです。

source: While this extension is still experimental and provides a limited feature set, we hope to get an early feedback for it. Currently, this extension supports Hibernate ORM and MongoDB with Panache and can generate CRUD resources that work with `application/json` and `application/hal+json` content.
ja_jp: このエクステンションはまだ実験的なものであり、限られた機能セットしか提供していませんが、早期にフィードバックが得られることを期待しています。現在のところ、このエクステンションは Hibernate ORM と MongoDB with Panache をサポートしており、 `application/json` と `application/hal+json` のコンテンツで動作する CRUD リソースを生成することができます。

source: While this is the easiest way to get your services running natively, it's less efficient than scanning the implementation classes at build time and generating code that registers them at static-init time instead of relying on reflection.
ja_jp: これはサービスをネイティブに実行する最も簡単な方法ですが、ビルド時に実装クラスをスキャンし、リフレクションに依存する代わりに static-init で登録するコードを生成する方法と比べると効率的ではありません。

source: While this level of automation is great for most use cases, there are times when you need more control and coordination over provisioned services.
ja_jp: このレベルの自動化はほとんどのユースケースに最適ですが、プロビジョニングされたサービスに対してより多くの制御と調整が必要な場合があります。

source: While typically codestart data is configured in <<codestart-yml>> files, platform developers may also provide codestart data in a platform descriptor with the purpose of customizing certain values.
ja_jp: 通常、コードスタートデータは <<codestart-yml>> ファイルで設定されますが、プラットフォーム開発者は、特定の値をカスタマイズする目的で、プラットフォーム記述子でコードスタートデータを提供することもできます。

source: While users are encouraged to use CDI annotations for injection, Quarkus provides a compatibility layer for Spring dependency injection in the form of the `spring-di` extension.
ja_jp: インジェクションにはCDIアノテーションを使用することが推奨されていますが、Quarkusでは、 `spring-di` エクステンションという形で、Springのディペンデンシーインジェクションのための互換レイヤーを提供しています。

source: While users are encouraged to use Hibernate ORM with Panache for Relational Database access, Quarkus provides a compatibility layer for Spring Data JPA repositories in the form of the `spring-data-jpa` extension.
ja_jp: ユーザーにはリレーショナルデータベースアクセスに Hibernate ORM with Panache の使用が勧められていますが、Quarkus は `spring-data-jpa` エクステンションの形式で Spring Data JPA リポジトリーの互換性レイヤーを提供します。

source: While users are encouraged to use JAX-RS annotation for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the `spring-web` extension.
ja_jp: RESTエンドポイントの定義にはJAX-RSアノテーションを使用することが推奨されていますが、QuarkusはSpring-webエクステンションという形でSpring Webとの互換性のあるレイヤーを提供しています。

source: While users are encouraged to use Jakarta REST (formerly known as JAX-RS) annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the `spring-web` extension.
ja_jp: RESTエンドポイントの定義には、Jakarta REST（旧称JAX-RS）アノテーションを使用することが推奨されていますが、Quarkusは、 `spring-web` エクステンションという形でSpring Webの互換性レイヤーを提供しています。

source: While users are encouraged to use Java standard annotations for security authorizations, Quarkus provides a compatibility layer for Spring Security in the form of the `spring-security` extension.
ja_jp: セキュリティ認可にはJava標準のアノテーションを使用することが推奨されていますが、Quarkusは、 `spring-security` エクステンションという形で、Spring Securityの互換性レイヤーを提供しています。

source: While users are encouraged to use REST Data with Panache for the REST data access endpoints generation, Quarkus provides a compatibility layer for Spring Data REST in the form of the `spring-data-rest` extension.
ja_jp: RESTデータアクセスのエンドポイント生成には、REST Data with Panacheを使用することが推奨されますが、Quarkusでは、 `spring-data-rest` エクステンションとしてSpring Data RESTの互換性レイヤーを提供しています。

source: While users are encouraged to use xref:cache.adoc[Quarkus annotations for caching], Quarkus nevertheless provides a compatibility layer for Spring Cache annotations in the form of the `spring-cache` extension.
ja_jp: ユーザーは xref:cache.adoc[キャッシュのQuarkusアノテーション]を使用することが推奨されていますが、Quarkusは、 `spring-cache` エクステンションの形式でSpring Cacheアノテーションのための互換性レイヤーを提供しています。

source: While users are encouraged to use xref:scheduler.adoc#standard-scheduling[regular Quarkus scheduler], Quarkus provides a compatibility layer for Spring Scheduled in the form of the `spring-scheduled` extension.
ja_jp: ユーザーは xref:scheduler.adoc#standard-scheduling[通常のQuarkusスケジューラ]を使用することが推奨されますが、Quarkusは `spring-scheduled` エクステンションの形でSpring Scheduledの互換性レイヤーを提供しています。

source: While users are encouraged to use xref:security-overview-concept.adoc#standard-security-annotations[Java standard annotations for security authorizations], Quarkus provides a compatibility layer for Spring Security in the form of the `spring-security` extension.
ja_jp: ユーザーには xref:security-overview-concept.adoc#standard-security-annotations[セキュリティ認可のためのJava 標準アノテーション] を使用することをお勧めしますが、Quarkus は `spring-security` エクステンション形式で Spring Security の互換性レイヤーを提供します。

source: While users are encouraged to use xref:security.adoc#standard-security-annotations[Java standard annotations for security authorizations], Quarkus provides a compatibility layer for Spring Security in the form of the `spring-security` extension.
ja_jp: ユーザーには xref:security.adoc#standard-security-annotations[Java standard annotations for security authorizations] を使用することをお勧めしますが、Quarkus は `spring-security` エクステンション形式で Spring Security の互換性レイヤーを提供します。

source: While using different JUnit extensions in combination with Quarkus component testing works fine most of the time, there are cases where it can become problematic.
ja_jp: 異なる JUnit エクステンションを Quarkus コンポーネントテストと組み合わせて使用することはほとんどの場合問題ありませんが、問題となる場合もあります。

source: While using non-blocking I/O has tremendous benefits, it does not come for free. Indeed, it introduces a new execution model quite different from the one used by classical frameworks.
ja_jp: ノンブロッキングI/Oを使用することは非常に大きなメリットがありますが、それは無料ではありません。実際、ノンブロッキングI/Oを使用すると、従来のフレームワークで使用されていたものとはまったく異なる新しい実行モデルが導入されます。

source: While using the `Validator` manually might be useful for some advanced usage, if you simply want to validate the parameters or the return value or your REST end point, you can annotate it directly, either with constraints (`@NotNull`, `@Digits`...) or with `@Valid` (which will cascade the validation to the bean).
ja_jp: `Validator` を手動で使用することは、高度な使用法には便利かもしれませんが、単にパラメーターや戻り値、RESTのエンドポイントを検証したい場合は、制約( `@NotNull`, `@Digits`...)や `@Valid` (Beanに検証をカスケードします)を使用して直接アノテーションすることができます。
